case/0/Ud
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ud;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
15600
(
(0.76395353076144 -0.000256827192816619 -1.25558474225143e-17)
(0.78619882710865 -0.00511480067706642 1.25127756167637e-17)
(0.809471638162698 -0.02288452717709 -6.00952532864483e-21)
(0.809126851155467 -0.0474810950105098 2.85703794412547e-18)
(0.772395641329299 -0.0699684471469781 7.49111562070364e-19)
(0.722471705537529 -0.0819561550623862 1.26261251421471e-18)
(0.679439688705017 -0.0872415470837876 4.511919539649e-17)
(0.646236332756787 -0.0892916362367725 -4.4775977068171e-17)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }

    sideRight_half1
    {
        type            empty;
    }

    sideLeft_half0
    {
        type            empty;
    }

    sideLeft_half1
    {
        type            empty;;
    }
}


// ************************************************************************* //
