case/0/aDelta
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      aDelta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
15600
(
(0.0025 -6.2636466514586 -0 0.0025 -0 0.0025)
(-0.203235265077642 -6.25863485189986 2.94404297513434e-17 0.105367632538821 -0 0.105367632538821)
(-1.0465616220988 -6.22968454150114 -0 0.527030811049399 -0 0.527030811049399)
(-2.31872737220893 -6.14929097723803 -0 1.16311368610447 -0 1.16311368610447)
(-3.8073474504204 -5.99946568752443 -0 1.9074237252102 -0 1.9074237252102)
(-4.87983075848989 -5.78009911769082 4.82708095977313e-17 2.44366537924494 -0 2.44366537924494)
(-5.45848425943276 -5.5201556829294 -0 2.73299212971638 -0 2.73299212971638)
(-5.67582666163951 -5.2488417621483 4.76667541858521e-17 2.84166333081976 -0 2.84166333081976)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           nonuniform List<symmTensor> 
120
(
(6.66666666666667e-16 -3.34033547419291e-12 -0 6.66666666666667e-16 -0 6.66666666666667e-16)
(-1.0904981103464e-13 -3.33766489138333e-12 7.8507812670249e-30 5.55249055173199e-14 -0 5.55249055173199e-14)
(-5.58789461592767e-13 -3.32224067723797e-12 -0 2.80394730796383e-13 -0 2.80394730796383e-13)
(-1.23724219402567e-12 -3.27941238279229e-12 5.77500298922209e-30 6.19621097012833e-13 -0 6.19621097012833e-13)
(-2.03117431939229e-12 -3.19959274931635e-12 -0 1.01658715969615e-12 -0 1.01658715969615e-12)
(-2.60321839997642e-12 -3.08269032164614e-12 2.52293089862414e-29 1.30260919998821e-12 -0 1.30260919998821e-12)
(-2.91190867191575e-12 -2.94413397721563e-12 1.24103232383357e-29 1.45695433595787e-12 -0 1.45695433595787e-12)
(-3.02789659474522e-12 -2.79949539240086e-12 1.27111344495606e-29 1.51494829737261e-12 -0 1.51494829737261e-12)
...
)
;
    }
    topWall
    {
        type            fixedValue;
        value           nonuniform List<symmTensor> 
120
(
(6.66666666666645e-16 3.22724389276171e-12 -0 6.66666666666678e-16 -0 6.66666666666678e-16)
(6.66666666666667e-16 3.22724389276241e-12 -0 6.66666666666667e-16 -0 6.66666666666667e-16)
(6.66666666666667e-16 3.22724389276171e-12 -0 6.66666666666667e-16 -0 6.66666666666667e-16)
(6.66666666666667e-16 3.22724389276171e-12 -0 6.66666666666667e-16 -0 6.66666666666667e-16)
(6.66666666666667e-16 3.22724389276241e-12 -4.04975097184295e-30 6.66666666666667e-16 -0 6.66666666666667e-16)
(6.66666666666667e-16 3.22724389276029e-12 4.04975097184295e-30 6.66666666666667e-16 -0 6.66666666666667e-16)
(6.66666666666667e-16 3.227243892761e-12 -0 6.66666666666667e-16 -0 6.66666666666667e-16)
(6.66666666666667e-16 3.227243892761e-12 -0 6.66666666666667e-16 -0 6.66666666666667e-16)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
