case/0/ccx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ccx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
15600
(
0.0400330813441108
0.12008860673469
0.199839191692114
0.278076555890878
0.352740610007525
0.422714026072904
0.488707852010148
0.551974332781044
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
0.0400380444494785
0.12009112920742
0.199800917836694
0.277973123732253
0.352564097866706
0.422486414070752
0.488446790561577
0.551688813173322
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
0.0375
0.1125
0.1875
0.2625
0.3375
0.4125
0.4875
0.5625
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            cyclic;
    }
    sideRight_half1
    {
        type            cyclic;
    }
    sideLeft_half0
    {
        type            cyclic;
    }
    sideLeft_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
