case/0/ccy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ccy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
15600
(
1.00195548402186
1.00097057324871
0.994974861300155
0.979069405354692
0.950971083730314
0.912370272400837
0.867147087547933
0.818142738010672
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
1
0.999013462385996
0.993013560517572
0.977106876033293
0.949013650492265
0.91039554727693
0.865122145123153
0.81604113176491
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
3.035
3.035
3.035
3.035
3.035
3.035
3.035
3.035
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            cyclic;
    }
    sideRight_half1
    {
        type            cyclic;
    }
    sideLeft_half0
    {
        type            cyclic;
    }
    sideLeft_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
