case/0/kd
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      kd;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
15600
(
0.00365386186206 
0.00378382367653 
0.0012134831361 
0.000435141261223 
0.000653092594261 
0.00105571162971 
0.000982363477517 
0.000608485130161 
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform 1e-15;
    }
    topWall
    {
        type            fixedValue;
        value           uniform 1e-15;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
