case/0/tau
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tau;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
15600
(
( 0.00440725563994 -4.54245861774e-05 0.0 -2.88065127966e-05 0.0 0.00280384176806  ) 
( 0.00449317392929 -0.000192727706772 0.0 -4.38651028115e-05 0.0 0.00292914082163  ) 
( 0.0013122582878 -0.000190953455852 0.0 9.37772791457e-07 0.0 0.00102973171857  ) 
( 0.000419731796543 -0.000136985410498 0.0 3.50188760362e-05 0.0 0.000385896151812  ) 
( 0.000595038351962 -0.000310752287129 0.0 0.000159169504271 0.0 0.000540003578396  ) 
( 0.000880480466597 -0.000578960620363 0.0 0.000379584137217 0.0 0.00084328004117  ) 
( 0.000760168533916 -0.000560762884264 0.0 0.00041313496819 0.0 0.000786643964671  ) 
( 0.000439506225028 -0.000359002062736 0.0 0.000292904843443 0.0 0.000482327200844  ) 
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           nonuniform List<symmTensor> 
120
(
(6.66529094673279e-16 -1.97339691912587e-16 -3.96462694141111e-35 6.6680180037459e-16 3.24373422789571e-33 6.66669104952131e-16)
(6.58916832545537e-16 -2.03034197482081e-16 3.18449191143023e-34 6.7186140476578e-16 -3.23726960359841e-33 6.69221762688683e-16)
(6.27830230470801e-16 -2.0607542994502e-16 2.97943212533995e-35 6.91918988425899e-16 -2.20200927601712e-36 6.80250781103299e-16)
(5.84713087418068e-16 -1.93750161644861e-16 1.66995301735755e-34 7.19172896161693e-16 -7.10195884190968e-34 6.9611401642024e-16)
(5.48865907790551e-16 -1.62538610678474e-16 -6.03243987502246e-35 7.40913785607227e-16 -1.73360169288779e-34 7.10220306602222e-16)
(5.34076090606057e-16 -1.34096639889833e-16 9.4510625445865e-34 7.49319640873105e-16 -3.31621635781435e-34 7.16604268520839e-16)
(5.28761175917432e-16 -1.16356362086094e-16 -5.66383778535075e-33 7.52111699280486e-16 -8.65425899147317e-33 7.19127124802082e-16)
(5.25757289623735e-16 -1.06788366972136e-16 7.55176127370717e-33 7.5372594036726e-16 7.90702872008474e-33 7.20516770009006e-16)
...
)
;
    }
    topWall
    {
        type            fixedValue;
        value           nonuniform List<symmTensor> 
120
(
(6.66666942409401e-16 1.9313435976028e-16 2.06838794802787e-37 6.66666361937104e-16 -5.60060224572112e-36 6.66666695653496e-16)
(6.66667458461958e-16 1.93125037820788e-16 -1.60456901936942e-37 6.66665799361126e-16 5.35253372202643e-37 6.66666742176916e-16)
(6.66667918293751e-16 1.93107816453707e-16 -9.96781512954657e-35 6.66665303705626e-16 6.29091012225788e-36 6.66666778000623e-16)
(6.66668383601897e-16 1.93082783647939e-16 5.00014691346125e-35 6.66664791378496e-16 7.38771495483651e-33 6.66666825019608e-16)
(6.66668814886691e-16 1.93050061904892e-16 -1.91548454532231e-34 6.66664316875412e-16 -3.6993321310694e-33 6.66666868237897e-16)
(6.66669174337015e-16 1.93010648203084e-16 2.41316599246974e-34 6.66663927122604e-16 3.68255932359314e-33 6.66666898540381e-16)
(6.66669473426861e-16 1.92965729927233e-16 -1.9163207839858e-34 6.66663601895098e-16 -3.68251516488217e-33 6.66666924678041e-16)
(6.66669719093794e-16 1.929162020957e-16 -9.94483444827813e-35 6.66663331794401e-16 -1.63915448307189e-35 6.66666949111805e-16)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }

    sideRight_half1
    {
        type            empty;
    }

    sideLeft_half0
    {
        type            empty;
    }

    sideLeft_half1
    {
        type            empty;;
    }
}


// ************************************************************************* //
