case/0/velocityGradient
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "0";
    object      velocityGradient;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<tensor> 
15600
(
(-1.73112747558051e-15 0 0 184.112858701993 0 0 3.80374689458608e-20 0 0)
(4.53551779382817 2.17697137109296e-17 0 183.965542482648 8.86252488141341e-16 0 7.78451242715914e-17 3.75293706002833e-34 0)
(23.1269911459064 0 0 183.114580622184 0 0 0 0 0)
(51.17240375004 0 0 180.751502089605 0 0 -1.55430371591369e-19 0 0)
(83.9896402623608 6.45017572437762e-15 0 176.347555965248 1.35982302485437e-14 0 8.07848657576199e-20 0 0)
(107.632972024162 0 0 169.899522012645 0 0 -1.3619868813525e-15 0 0)
(120.389624360828 0 0 162.258776686822 0 0 -8.34903463259483e-20 0 0)
(125.181026224724 0 6.67074869621399e-32 154.283808694491 0 8.26053873540485e-32 -1.34502522901894e-15 0 -7.19584283448442e-49)
...
)
;

boundaryField
{
    bottomWall
    {
        type            zeroGradient;
    }
    topWall
    {
        type            zeroGradient;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
