case/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(-0.0347517967595156 0 0)
(-0.0347415976437862 -0.000285277220999192 -1.81087676659653e-22)
(-0.0350204458418364 -0.00144363301534348 0)
(-0.036335968329073 -0.00309794472349159 -5.45283853193023e-21)
(-0.0391425485843879 -0.00477115575821881 -3.27862702325161e-24)
(-0.041589758196845 -0.00572108118960041 4.58605221551992e-20)
(-0.0426539285070319 -0.00608369857215545 -2.56379690509963e-20)
(-0.042469060235043 -0.00611687792568916 7.99859307301141e-20)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(-0.0335752276144482 -1.1235288494221e-19 -0)
(-0.0335752276144556 -0 -0)
(-0.0335752276144482 -0 -0)
(-0.0335752276144482 -0 -0)
(-0.0335752276144556 -0 -0)
(-0.0335752276144335 -0 -0)
(-0.0335752276144408 -0 -0)
(-0.0335752276144408 -0 -0)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
